testcase/cylinderMeshLarge/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    overset2
    {
        type            overset;
        nFaces          120;
        startFace       7080;
        faces           ( ( 5 13 12 4 ) ( 6 14 13 5 ) ( 7 15 14 6 ) ( 4 12 15 7 ) );
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       7200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7200;
        startFace       7320;
    }
)

// ************************************************************************* //
